<a href="https://colab.research.google.com/github/Abinn0612/Python_Analisis_Visualisasi_data/blob/main/Series_List_Dictionary.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#**MENGENAL SERIES**

##**Membuat Series**

In [ ]:
# Mengimport pandas
import pandas as pd

In [ ]:
teman = ['Joni Gudel', 'Edi Yunani', 'Toni Sulung', 'Retno Mimin'] # Membuat list bernama 'teman'

In [ ]:
pd.Series(teman) # Mengubah list menjadi series menggunakan konstruktor series

0     Joni Gudel
1     Edi Yunani
2    Toni Sulung
3    Retno Mimin
dtype: object

##**Data Type**

In [ ]:
usia = [17, 21, 33, 45] # Membuat list bernama 'usia'

In [ ]:
pd.Series(usia) # Mengubah list menjadi Series Menggunakan konstruktor Series

0    17
1    21
2    33
3    45
dtype: int64

In [ ]:
berat = [77.5, 46.8, 52.3, 66.8] # Membuat seluruh elemen bertipe data float atau pecahan
pd.Series(berat)

0    77.5
1    46.8
2    52.3
3    66.8
dtype: float64

###**Tipe Data Object**

In [ ]:
dataacak = [17, 'yogyakarta', 18.5, {'kondisi': 100}] #  Tipe data object akan dihasilkan apabila isi dari elemen berbentuk tipe data campuran
pd.Series(dataacak)

0                  17
1          yogyakarta
2                18.5
3    {'kondisi': 100}
dtype: object

#**KARAKTERISTIK DATA PADA SERIES**

##**List dan Dictionary**

In [ ]:
pd.Series(teman)

0     Joni Gudel
1     Edi Yunani
2    Toni Sulung
3    Retno Mimin
dtype: object

###**Membuat Series dari Dictionary**

In [ ]:
temanakrab = {1: 'Joni Gudel', 1: 'Edi Yunani', 2: 'Toni Sulung', 3: 'Retno Mimin'} # Membuat dictionary dengan nama 'temanakrab'
pd.Series(temanakrab) #Menampilkan seluruh key dan nilai pada dictionary menggunakan Series

1     Edi Yunani
2    Toni Sulung
3    Retno Mimin
dtype: object

###**Method Equals**
---
Pada Pandas, series yang dibuat menggunakan list maupun dictionary akan diangap sama. Kita bisa menguji kedua series menggunakan list dan dictionary itu memanfaatkan method **equals()**.

In [ ]:
# Meletakan Series ke dalam variabel a dan b
a = pd.Series(teman)
b = pd.Series(temanakrab)

In [ ]:
a.equals(b) # Method equals() untuk menguji Series a dan b

False

##**Menagtur label pada Dictionary**
---
Pada dictionary, label dapat dibuat lebih fleksibel karena mengikuti tipe data pada key yang kita buat saat dictionary itu dibentuk. Berbeda dengan list yang selalu memiliki nomor index urut, pada dictionary anda bisa menentukan 'index' untuk masing-masing nilai dengan lebih bebas. Seperti contoh nilai pertama diberi nomor urut 5 dan nilai terakhir diberi nomor urut 0.

In [ ]:
temanakrab = {3: 'Joni Gudel', 2: 'Edi Yunani', 1: 'Toni Sulung', 0: 'Retno Mimin'}
pd.Series(temanakrab)

3     Joni Gudel
2     Edi Yunani
1    Toni Sulung
0    Retno Mimin
dtype: object